[
  {
    "Title": "boAt Stone 350 10 W Bluetooth Speaker (Blue, Mono Channel)",
    "SKU": "itmcd2b66991731f",
    "Description": "Its time to enjoy a seamless playback experience courtesy boAt Stone 350 10W portable wireless speaker. The speaker comes equipped with 1.96 dynamic drivers for an immersive stereo experience. It supports instant wireless connectivity with Bluetooth v5.0. The speaker pumps out nonstop audio for up to 12 hours on a single full charge. Apart from the wireless connectivity it comes equipped with the provision for AUX and TF Card connectivity as well. Its a cylindrical construct and an IPX7 rated water resistance for a carefree listening time and easy portability. Immerse into the realm of wherever you go, with boAt Stone 350. The speaker also supports TWS feature meaning you can connect two Stone 350s and forge them into one for a bigger impact.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/kingqkw0-0/speaker/mobile-tablet-speaker/u/1/2/stone-350-boat-original-imafyebfjguufap8.jpeg?q=70&crop=false"
  },
  {
    "Title": "Aroma NB120 Amaze Upto 50 Hours* Playtime, Fast Charging, Dual Pairing Neckband Bluetooth (Beam Blue, In the Ear)",
    "SKU": "itmedc6d4ff60c9b",
    "Description": "Discover the ultimate in audio convenience and comfort with the Neckband. Engineered for exceptional performance and designed for all-day wear, this neckband is perfect for both casual listenersRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/shopsy-headphone/u/a/f/bluetooth-yes-nb120a-upto-50-hours-playtime-fast-charging-dual-original-imah755sftjrdu7a.jpeg?q=70&crop=false"
  },
  {
    "Title": "boAt Wave Call 2 Plus with 1.96’’(4.97cm), BT Calling, Bilingual Support, IP68 Smartwatch (Active Black Strap, Free Size)",
    "SKU": "itma05add2b956e0",
    "Description": "Get your hands on the perfect blend of tech and design with the boAt Wave Call 2 Plus Smartwatch. By supporting functions in two languages- English and Hindi, this watch offers increased convenience and effortless use.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/smartwatch/v/j/g/-original-imah7e8bdedjpq7s.jpeg?q=70&crop=false"
  },
  {
    "Title": "Boult Astra with Quad Mic ENC, 48Hrs Battery, Low Latency Gaming, Made in India, 5.3v Bluetooth (Black Gloss, True Wireless)",
    "SKU": "itm6b31cec7596a8",
    "Description": "Elevate your gaming experience with Boult Astra earbuds. Dominate the gameverse with 48 hours of playtime and 120 hours of standby, ensuring uninterrupted gaming sessions. Enjoy Lightning Boult type C fast charging, where just 10 minutes of charging fuels 100 minutes of playtime. Communicate seamlessly with ZEN quad mic ENC, enhancing call clarity. Activate Combat gaming mode with 40ms ultra low latency, achieving seamless and responsive gameplay. The breathing LED feature adds a dynamic visual element that syncs with your every move. Express your style with classy color variants like Black Gloss, White Opal, and Smoky Metal. Experience swift pairing through Blink & Pair and Bluetooth 5.3 technology, ensuring you're always ready for action. The innovative BoomX Technology and 13mm drivers deliver a powerful, supreme bass, immersing you in the audio. Navigate effortlessly with touch controls, and access the voice assistant for convenient commands. The IPX5 water resistance provides durability, allowing you to game confidently in any environment. Dominate the competition and embrace victory with Boult Astra earbuds your ultimate gaming companion.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/headphone/j/p/r/-original-imah3dwf6xjtzk7d.jpeg?q=70&crop=false"
  },
  {
    "Title": "NOVA NHT 1042 USB Trimmer 60 min Runtime 5 Length Settings (Blue, Silver)",
    "SKU": "itm4c7a578356aad",
    "Description": "Now you can achieve a neat and trim look at home with this nova trimmer. While its 0.5 mm precision blades give you the ideal look, its ergonomic design and 60 mins run time helps you hold it comfortably while trimming uninteruptly . The 5 precision length settings allows you to trim and moreover gives an added advantage to choose the length of your desired choice.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/trimmer/2/k/r/0-5-12-mm-nht-1042-usb-stainless-steel-cordless-nova-original-imah7fepxzhtadag.jpeg?q=70&crop=false"
  },
  {
    "Title": "Pigeon Mio Gift Set Non-Stick Coated Cookware Set (Aluminium, 8 - Piece)",
    "SKU": "itmadb105625b80c",
    "Description": "This Pigeon Pack of 8 Kitchen Set is an incredible buy for your home. Not only do you get three state-of-the-art cooking containers, but you also get 4 spatulas for the pan and the tawa. Seems like a really good deal.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/k0plpjk0/cookware-set/5/h/4/mio-650-pigeon-original-imafkfuqjysdjzrx.jpeg?q=70&crop=false"
  },
  {
    "Title": "Boult Bassbox Q10 with 10W Bass Boosted, Compact Design, Dual Passive Radiator, 5.4v 10 W Bluetooth Speaker (Black, Stereo Channel)",
    "SKU": "itm5965673e95af2",
    "Description": "Unleashing Boult Q10 Power-Packed Sound in a Compact Design, 10W Bass Boosted Audio with BoomX Technology, delivering powerful sound through a full-range bass driver and dual passive radiators for deep, punchy beats. Whether you're indoors or outdoors, experience immersive audio like never before. With a long-lasting battery, the Boult Q10 keeps your music playing for hours without interruption. Need more ways to play? Enjoy multi-mode compatibility with BT/AUX/TF card/USB & Type-C input mode for endless entertainment. Designed for portability, the Q10s perforated mesh grille and compact pocketable build make it easy to carry anywhere. The integrated lanyard adds convenience, letting you take the music wherever you go. Effortless button navigation allows you to control playback, volume, power, and mode selection with ease. Seamlessly connect with Bluetooth 5.4 for a stable and fast pairing experience across smartphones, TVs, PCs, and tablets. As Indias #1 rated audio brand, Boult brings you the perfect fusion of power, portability, and premium sound. Elevate your audio experience with Q10 todayRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/speaker/e/z/8/-original-imahahdbjn2ym2yd.jpeg?q=70&crop=false"
  },
  {
    "Title": "Apple iPhone 16 (Black, 128 GB)",
    "SKU": "itmb07d67f995271",
    "Description": "iPhone 16. Built for Apple Intelligence. Featuring Camera Control. 48 MP Fusion camera. Five vibrant colours. And A18 chip.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/mobile/8/w/5/-original-imah4jyfwr3bfjbg.jpeg?q=70&crop=false"
  },
  {
    "Title": "Aroma NB119 Pro Belief Upto 48H Playtime* Fast Charging, Dual Pairing Neckband Bluetooth (Midnight Black, In the Ear)",
    "SKU": "itm2c7088a55ed94",
    "Description": "Discover the ultimate in audio convenience and comfort with the NB119 Pro Belief Bluetooth Neckband. Engineered for exceptional performance and designed for all-day wear, this neckband is perfect for both casual listeners and active users. Long-Lasting Playtime: Enjoy up to 48 hours of continuous playback. Come equipped with a high-performance inbuilt microphone designed to enhance your communication experience.Ensuring your voice is heard clearly during calls and voice commands. This microphone excels in various environments, whether you are in a busy cafe or a quiet office, providing reliable and crisp audio. Enjoy seamless conversations and voice interactions with a mic that's built for precision and clarity. Comfort and Fit: Designed with a lightweight, ergonomic neckband and comfortable earbuds, this device offers a secure and comfortable fit for all-day use. Its IPX4 sweatproof rating means it can handle your toughest workouts and daily activities. Immersive Sound Quality: Experience crystal-clear audio and booming bass with precision-tuned drivers. Whether it’s the subtle rustle of footsteps or the explosive sound effects, every detail comes through with exceptional clarity. Dual Pairing Capability: Stay connected to two Bluetooth devices simultaneously. Easily switch between calls, music, and media on your phone and tablet or laptop without the hassle of constantly re-pairing.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/headphone/g/p/v/nb119-pro-belief-upto-48h-playtime-fast-charging-dual-pairing-original-imah873fjtfajqsy.jpeg?q=70&crop=false"
  },
  {
    "Title": "JBL Go Essential with Rich Bass, 5 Hrs Playtime, IPX7 Waterproof, Ultra Portable 3.1 W Bluetooth Speaker (Blue, Mono Channel)",
    "SKU": "itmabad18a769b0e",
    "Description": "You can listen to your favourite songs in high quality with the JBL Go Essential Portable Bluetooth Speaker. With up to 5 hours of playtime on a single charge, this speaker delivers an uninterrupted audio experience. As this speaker boasts an IPX7-rated waterproof design, so you can carry it wherever you want, whether in a pool or a park. In addition, thanks to its Bluetooth 4.2 connectivity, this speaker lets you conveniently stream a wide range of songs from your tablet, phone, or any other Bluetooth-enabled device. Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/l5bd5zk0/speaker/3/9/j/-original-imaggyhu2rcvdgwh.jpeg?q=70&crop=false"
  },
  {
    "Title": "Fire-Boltt Ninja Calling Pro Plus 46.5mm (1.83) Display Bluetooth Calling, AI Voice Smartwatch (Black Strap, Free Size)",
    "SKU": "itm37ac5957c9c50",
    "Description": "Offering exceptional performance, the Fire-Boltt Ninja Calling Pro BSW039 Plus Smartwatch is an ideal pick. Owing to its inbuilt dial pad, contact sync options, and call history, this smartwatch lets you easily make or receive calls for a seamless calling experience. Courtesy of its inbuilt mic and speaker, this smartwatch enables you to clearly communicate with your loved ones. Also, with the help of your smartphone’s voice assistant, you can effortlessly control this smartwatch by giving voice instructions.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/smartwatch/d/g/r/-original-imahyz5xakhgchhn.jpeg?q=70&crop=false"
  },
  {
    "Title": "DELL 15 Intel Core i3 12th Gen 1215U - (8 GB/512 GB SSD/Windows 11 Home) 3520 Thin and Light Laptop (15.6 inch, Carbon Black, 1.69 Kg, With MS Office)",
    "SKU": "itm5d692e615c97e",
    "Description": "Combining sleek design with powerful features,the DELL Vostro 3520 39.62 cm (15.6) is an ideal addition to your setup Featuring a wide display (120Hz/250Nits) with three-sided narrow bezels,this laptop provides a smooth and enjoyable user experience with Dell ComfortView display technology it minimises eye strain & the FHD display further enhances the visual experience, this laptop comes with Lift hinge which gives a comfortable typing angle and improved air circulation under your device to work longer on your laptop comfortabily. Furthermore, this laptop comes with Hardware Trusted Platform Module (TPM 2.0**) Chip which adds an extra layer of security,Stay worry free from Attackers and prevents Data leaks,the system is Military tested (MIL-810H)** which can be used in difficult environmental conditions. more over the system is equipped with a full-size spill-resistant keyboard and a large touchpad, excellent sound quality with dual stereo Speakers enjoy the smooth performance with express charge up to an 80% charge in one hour. laptop includes pre installed Office 2021 Home and Student lifetime subscription,ensuring peak performance.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/computer/u/c/7/-original-imah9gv6zjdbhcs2.jpeg?q=70&crop=false"
  },
  {
    "Title": "Leo Creation 144 TC Cotton Double Jaipuri Prints Flat Bedsheet (Pack of 1, Blue, Green, Red, Grey, Light Grey)",
    "SKU": "itm01d046e58c077",
    "Description": "Jaipur Bedsheet home for their form and function, and experience their style, craftsmanship, and value. We travel the world to find materials and designs for home pictures products and use the most sensible manufacturing methods. Check out all of our Bedsheet and you'll find something for all occasions. With a selection that continues to grow, this is set to become a part of your lifestyle. Features : soft luxury bedding . This bed sheet is soft and smooth to the touch providing elegance and sophistication bed sheet its give the graceful and modern look for any bedroom fade-resistant these sheets are made of high strength micro fiber yarns that stay comfy and wrinkle-less for year to come. These sheets retain their vibrant color, providing the needed charm to complete any bedroom. Care Instructions: machine wash in cold water, tumble dry on low heat, and do not bleach, dry clean, or iron. What's included: bed sheet and standard sized pillow cases accessories: check out our Leo Creation store.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/shopsy-bedsheet/w/x/1/lc-9-1-lc-1-9-leo-creation-original-imah5r8etcfp7c3h.jpeg?q=70&crop=false"
  },
  {
    "Title": "Prestige Omega Festival Pack Induction Bottom Non-Stick Coated Cookware Set (Aluminium, 3 - Piece)",
    "SKU": "itm55ee2b2b42b82",
    "Description": "Featuring a frying pan, tawa, kadai and glass lid, this Prestige cookware set is designed for healthy cooking. Crafted for the Indian household, this cookware comes with a good-quality aluminium body, an induction- and gas-compatible base and a chemical-free, non-stick coating.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/cookware-set/0/6/r/-original-imah3nzdyv3syftn.jpeg?q=70&crop=false"
  },
  {
    "Title": "PHILIPS BT3101/15 Trimmer 45 min Runtime 10 Length Settings (Black, White)",
    "SKU": "itm4b45b688873c9",
    "Description": "Product Lift and Trim TechnologyThis trimmer's lift and trim technology is designed to give you precise and even trimming results every time, elevating your grooming experience. This feature works by lifting flat-lying hairs and guiding them towards the ultra-sharp blades, ensuring no strand is left behind. By targeting even the most challenging areas, it saves you time and effort, delivering a flawless finish that you can rely on. Self-sharpening BladesFeaturing consistently sharp performance with self-sharpening stainless steel blades, this trimmer is designed to maintain its cutting edge with every use, meaning you can enjoy precision without frequent replacements. The hassle-free maintenance means you can focus on your grooming routine without worrying about extra upkeep. The self-sufficient blades are engineered to perform at their best without the need for lubrication, ensuring a smooth and consistent trimming experience every time. Washable HeadMaintaining hygiene and performance is effortless with a fully washable head. After each use, simply rinse the trimmer under running water to remove any hair or residue. This easy-to-clean design ensures that your trimmer stays in top condition, prolonging its life and maintaining its cutting efficiency. The washable head makes post-trimming cleanup a breeze, allowing you to enjoy a fresh and clean grooming tool every time. Cordless ConvenienceThe trimmer offers cordless performance with up to 45 minutes of runtime on a single charge. The cordless design eliminates the hassle of tangled cords, giving you complete mobility during your grooming routine. A single charge provides up to three weeks of trimming, making it an ideal companion for travel or on-the-go use, ensuring that you always look your best wherever you are. Versatile Lock-in Length SettingsThis trimmer provides versatility in styling with 10 customisable lock-in length settings that offer precision down to 1 mm. Whether you're aiming for a clean stubble, a short beard, or a more defined facial hair style, this trimmer gives you the flexibility to create your desired look. With this level of precision, you can experiment with various styles or maintain your signature look with confidence, knowing that the trimmer will deliver consistent results. View all features",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/kuof5ow0/trimmer/7/z/f/0-5-10-mm-bt3101-15-stainless-steel-cordless-philips-original-imag7r4r7ztgnuyk.jpeg?q=70&crop=false"
  },
  {
    "Title": "Ambrane 10000 mAh 22.5 W Wireless With MagSafe Power Bank (Silver, Lithium Polymer, Fast Charging, Power Delivery 3.0, Quick Charge 3.0 for Earbuds, Laptop, Mobile, Smartwatch, Tablet, Trimmer)",
    "SKU": "itmcfbef08c95b54",
    "Description": "Introducing the Aerosync Snap, a powerful 10000 mAh MagSafe power bank designed for seamless charging on the go. With a maximum output of 22.5W and multiple charging ports, including a 22W Type-C, 22.5W USB-A, and 15W MagSafe output, this power bank offers versatile and efficient power delivery. It supports PD 3.0, QC 3.0, VOOC, and PPS protocols, ensuring compatibility with a wide range of devices. The Snap features a premium rubberized coating and 5 LED indicators for easy status monitoring. Compatible with 12 and above for MagSafe, as well as all 8 and above models and Android phones through wired and wireless connections, this power bank is your reliable charging companion.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/power-bank/0/w/e/-original-imah439zfbmnvrgf.jpeg?q=70&crop=false"
  },
  {
    "Title": "Boult Trail 2.01\" 3D Curved HD Display, Working Crown, 190+ Watch Faces, Health Track Smartwatch (Jade Green Strap, Free Size)",
    "SKU": "itm69268aeb3e215",
    "Description": "Discover the ultimate fusion of style and comfort with the Boult Trail Smartwatch. Designed with your comfort in mind, its unique curved display and expansive 2.01\"\" HD screen deliver stunning visuals while seamlessly fitting around your wrist. Stay effortlessly connected with single chip BT 5.3 calling and enjoy smooth navigation with the working crown feature. Prioritize yourRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/smartwatch/l/z/v/-original-imahyxqdgfwwsdgz.jpeg?q=70&crop=false"
  },
  {
    "Title": "Cosito 144 TC Cotton Double Jaipuri Prints Flat Bedsheet (Pack of 1, Light Red)",
    "SKU": "itm57cb5ddf0697a",
    "Description": "Kunal Prints presents a exclusive collection of jaipuri printed double bed sheet set with two pillow covers. Our premium collection gives a elegant aura to your bedroom .It comes in vibrant and soothing colors. This bed sheet set is made from superior quality cotton. It can be maintained very easily. Be sure of gifting it to a loved one as well.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/bedsheet/j/f/9/traditional-jaipuri-print-1-big-peacock-red-flat-cosito-original-imahbtf9hmfntb5f.jpeg?q=70&crop=false"
  },
  {
    "Title": "One Plus OP 11 Cordless Professional Hair Trimmer Titanium coated blade waterproof Trimmer 120 min Runtime 12 Length Settings (Black, Green)",
    "SKU": "itm3a37aea633a7f",
    "Description": "Introducing the One Plus Beard Trimmer – your ultimate grooming companion for a precise and stylish beard look. Engineered with cutting-edge technology and a sleek design, this beard trimmer is set to redefine your grooming experience. Key Features: 1. **Precision Cutting Blades:** The One Plus Beard Trimmer is equipped with ultra-sharp stainless steel blades that ensure a clean and precise trim every time. Achieve the perfect beard length with ease and confidence. 2. **Adjustable Length Settings:** Customize your beard style with multiple length settings. Whether you prefer a short stubble or a longer, well-groomed beard, the adjustable settings make it simple to achieve the look you desire. 3. **Long Battery Life:** Say goodbye to frequent charging interruptions. The One Plus Beard Trimmer boasts an extended battery life, ensuring that you can achieve your desired look without the hassle of constant recharging. 4. **Fast Charging Technology:** When time is of the essence, the fast charging feature comes to the rescue. Charge your trimmer quickly for a last-minute touch-up or a spontaneous grooming session. 5. **Ergonomic Design:** The sleek and ergonomic design of the One Plus Beard Trimmer fits comfortably in your hand, providing maximum control and ease of use. Trim with confidence, knowing you have a tool designed for your comfort. 6. **LED Display:** Keep track of your trimming progress with the built-in LED display. Monitor battery life and length settings at a glance, ensuring a seamless grooming experience. 7. **Easy Maintenance:** The detachable blades make cleaning and maintenance a breeze. Simply rinse the blades under running water for quick and efficient cleanup. 8. **Travel-Friendly:** Designed with the on-the-go individual in mind, the One Plus Beard Trimmer is compact and travel-friendly. Maintain your well-groomed look wherever life takes you. Upgrade your grooming routine with the One Plus Beard Trimmer – where innovation meets style. Unleash your confidence and redefine your beard game with precision and ease.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/shopsy-trimmer/u/e/7/trimmer-0-5-12-mm-stainless-steel-op-11-cordless-professional-original-imah8dnjxzhkaztc.jpeg?q=70&crop=false"
  },
  {
    "Title": "OPPO K12x 5G with 45W SUPERVOOC Charger In-The-Box (Feather Pink, 128 GB) (6 GB RAM)",
    "SKU": "itma30cb38861d4c",
    "Description": "NARead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/mobile/j/o/z/-original-imah4qke9gf7jhfg.jpeg?q=70&crop=false"
  },
  {
    "Title": "SAREGAMA Carvaan Hindi Bluetooth speaker 10 W Bluetooth Speaker (Oak Wood Brown, Stereo Channel)",
    "SKU": "itm8e0022b025d07",
    "Description": "This Saregama Carvaan Hindi Bluetooth Speaker combines nostalgia with modern convenience, offering 5000 pre-loaded evergreen Hindi songs. Its lightweight design and long battery life make it perfect for on-the-go listening. With an intuitive jog dial, easily switch between genres and moods, enjoying original tracks without interruptions. Ideal as a gift, Carvaan delivers a seamless music experience, backed by an all-India service network, ensuring both quality and convenience.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/jyxaw7k0/speaker/home-audio-speaker/k/n/u/saregama-sc01-sc02-sc03-original-imaf8dujbjg55vbr.jpeg?q=70&crop=false"
  },
  {
    "Title": "Boult Drift+ Bluetooth Calling, 1.85\" HD, 500 Nits Brightness, 150+ Watchfaces, Smartwatch (Black Coffee Strap, Free Size)",
    "SKU": "itm299eb0c3ef1a6",
    "Description": "You can stay connected to the digital world at all times with the help of the Boult Drift+ Smartwatch. It features a large touchscreen HD display of up to 4.69 cm (1.85), offering up to 500 nits of brightness for clear and vibrant visuals. Also, this smartwatch features Bluetooth calling with a dedicated speaker and microphone, making call management hassle-free. Besides, with real-time monitoring of heart rate 24x7, blood pressure, and SpO2 blood oxygen saturation, this smartwatch allows you to keep important health parameters in check. Furthermore, this smartwatch lets you monitor menstrual cycles and sleep cycles and reminds you to drink water and move if you are sedentary for too long.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/smartwatch/b/z/c/-original-imah8mtxng4azdhe.jpeg?q=70&crop=false"
  },
  {
    "Title": "ASUS Vivobook 15 Intel Core i3 13th Gen 1315U - (16 GB/512 GB SSD/Windows 11 Home) X1504VA-NJ2325WS Thin and Light Laptop (15.6 Inch, 1B&Quiet Blue, 1.7 Kg, With MS Office)",
    "SKU": "itm35fb3f9516635",
    "Description": "Product PerformanceWith Vivobook 15, you’re always ready to take on any everyday task, whether it’s work, play or entertainment. Whatever you need to achieve, there’s always plenty of computing power on tap with up to the 12th Gen Intel U-Series processor, DDR4 of fast memory, PCIe SSD storage and comprehensive range of wireless connectivity up to WiFi 6E allows you to load online content in the blink of an eye. BatteryVivobook 15 supports fast charging which allows you to charge a low battery to 60% in as little as 49 minutes3, so you can be up and running quicker than ever! DisplayVivobook 15 delivers beautifully clear visuals with its three-sided slim-bezel NanoEdge display. The wide viewing angles maintain great quality even for off-center viewing, and the TUV Rheinland eye-care certification ensures low blue-light levels that reduce the risk of eye strain during long viewing sessions. AudioDesigned with help from the audio experts at Dirac, a professional audio solution provider, the audio system delivers the most immersive, clear, and balanced sound experience you’ve ever heard on a PC, laptop or tablet. You’ll hear a wider and deeper soundscape than you could imagine, unleashing the full audio potential of your laptop. DesignVivobook 15 has a lid with a special raised logo tag, and it’s available in your choice of three eye-catching colors: charming Quiet Blue, , or Cool Silver just pick your favorite! It’s slim enough to pop unobtrusively into any backpack, and light enough for easy one-handed carrying. KeyboardYour comfort is our highest priority. That’s why the ASUS ErgoSense keyboard has an incredibly satisfying feel, with the optimum key bounce and travel calculated with fine-tuned precision. Experience the ErgoSense keyboard and you’ll soon find yourself cruising effortlessly through your work. Antimicrobial Guard PlusASUS Antimicrobial Guard Plus is applied to frequently touched areas of your laptop to help keep it hygienic. This technology uses a denser treatment* that inhibits viruses and bacteria. And it is scientifically shown — using the ISO 2170211 and 2219612 standards — to inhibit virus and bacteria growth by more than 99% over a 24-hour period4. Strains used for the tests include the SARS-CoV-2 (COVID-19), H3N2 (Influenza A) and the E. coli bacterium. SecurityIntegrated privacy shield slides over the 720P HD webcam for instant privacy protection against prying eyes and disturbances. HingeVivobook 15 features a precision-engineered, lay-flat hinge that makes it easy to share content with others, or collaborate with a group of people around a table. ConnectivityVivobook 15 keeps you fully connected with its comprehensive I/O ports. There are one USB 3.2 Type-C Gen 1 port, two USB 3.2 Type-A Gen 1 ports, a USB 2.0 port, HDMI® output and an audio combo jack — so it’s easy to connect all your existing peripherals, displays and projectors. AI Noise CancelationTo provide exceptional remote-working and video-conferencing experiences, features ASUS AI Noise-Canceling Technology that employs machine learning in order to isolate unwanted noise from human speech. This technology helps to filter out ambient noise for optimum group conference-call quality. 3DNR WebcamASUS 3D Noise Reduction (3DNR) Technology significantly upgrades the webcam image clarity for clearer conference calls. Military-gradeASUS laptops are engineered with extraordinary toughness meet the exacting US MIL-STD-810H military-grade standard, undergoing 12 rigorous test methods and 26 punishing test procedures — exceeding industry standards. View all features",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/computer/x/n/l/-original-imahbrxfmfzzpkh7.jpeg?q=70&crop=false"
  },
  {
    "Title": "BEARDO Ape-X Prime Trimmer For Men Trimmer 120 min Runtime 3 Length Settings (Black)",
    "SKU": "itmc9b92b4e799f6",
    "Description": "Beardo's Ape-X Prime 3-in-1 Multipurpose trimmer is armed with a variety of length settings suitable for beards of all lengths, thicknesses and types. It is equipped with razor sharp and highly zero gap blade technology blades for clean, precise trims. Its T-blades ensure an even trim even in tricky areas unreached by regular trimmers.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/trimmer/v/q/n/0-5-5-mm-trimmer-for-men-stainless-steel-corded-cordless-beardo-original-imagyr3yxkysu2m5.jpeg?q=70&crop=false"
  },
  {
    "Title": "Soroo Future Long Bar Dual-Speaker Multimedia Radio Bluetooth Audio Support TF Card/U Disk 01 16 W Bluetooth Home Theatre (Black, 5.1 Channel)",
    "SKU": "itmc47ec95eb601e",
    "Description": "Z-91 is a lightweight portable speaker in a soundbar form factor that comes with multi-connectivity options like BT/ USB/mSD/AUX. The speaker is known for its room-filling sound and pumping bass. It also has a call function and comes with controls for media/volume along with a built-in FM Radio.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/speaker/gaming-speaker/0/k/a/bluetooth-wireless-portable-speaker-5-0-soundbar-upto-19-hrs-original-imahysv2h7qzsmuk.jpeg?q=70&crop=false"
  },
  {
    "Title": "Nu Republic Sonicpop 1200 with Upto 18 Hrs Playtime, X-Bass, 3x1 Powerful Dynamic Drivers 60 W Bluetooth Speaker (Black, Stereo Channel)",
    "SKU": "itmf3ea43a8df493",
    "Description": "Experience unparalleled sound quality with the Nu Republic Sonicpop 1200 Bluetooth Speaker. Designed for music enthusiasts, this powerful 60W speaker features three dynamic drivers that deliver rich, immersive audio with enhanced X-Bass for a deep, resonant experience. Enjoy up to 18 hours of uninterrupted playtime, making it perfect for parties or outdoor gatherings. The included karaoke microphone adds a fun twist, allowing you to showcase your vocal talents. With its sleek black design and stereo channel capabilities, the Sonicpop 1200 is not just a speaker; it's a complete entertainment solution. Elevate your audio experience today.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/speaker/mobile-tablet-speaker/t/t/d/sonicpop-1200-with-upto-18-hrs-playtime-x-bass-3x1-powerful-original-imahash4zgb9bqtx.jpeg?q=70&crop=false"
  },
  {
    "Title": "boAt Rockerz 110 with 40 HRS Playback, ENx Technology, Beast Mode & ASAP Charge Bluetooth (Fern Green, In the Ear)",
    "SKU": "itmbe0acd8f09dfb",
    "Description": "Take your tunes on the go with the boAt Rockerz 110 Neckband Earphones. Ample 40 hours of playtime can keep you entertained without charging woes. Simply bring the magnetic buds together and get started- watch live matches, game with your squad, or just relax to mellow tunes on your playlist. Additionally, you can enjoy these activities across two devices with dual pairing. Answer calls on your phone and seamlessly toggle back to the movie on your laptop. With ENxTM-enabled mics, you can delve into your private audio zone even in bustling outdoor areas. By canceling noise in your surroundings, Rockerz 110 delivers sharp sound whether you are at the airport or in a crowded workspace. Audio is further augmented by the boAt Signature Sound from high-performance 10 mm drivers so you can feel the bass to the fullest. Gaming gets elevated to the next level not just with the rousing audio but also the lag-free synchronization of BEAST? Mode. End low battery struggles with ASAP? Charge which adds almost 10 hours of playtime after just 10 minutes of charging. Moreover, these earphones boast multi-functional buttons to control both the playback and the volume. Apart from the integrated controls, you can activate Siri or Google Assistant and say your commands aloud to accomplish a host of tasks. Enjoy enhanced listening with Rockerz 110!Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/headphone/x/v/m/-original-imaguhrxfvg7mgqq.jpeg?q=70&crop=false"
  },
  {
    "Title": "IMPEX Nonstick Granite Festival GiftMFKT 5 Layer Super Granite Induction Bottom Non-Stick Coated Cookware Set (Aluminium, 6 - Piece)",
    "SKU": "itm120bcd2864774",
    "Description": "The Impex Migo Nonstick Granite HTR 6 Pcs MFKT Set comes with 5-layer Super Granite Nonstick coating. This 6 pcs cookware set will enable you to prepare a variety of healthy food while also giving your kitchen a sense of elegance. The cookware set includes 1 Tawa Pan 24cm, 1 Fry pan 24cm, 1 Kadai Pan 24cm, 1 Spoon Spatula, 1 Flat Spatula And 1 Glass LidRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/cookware-set/h/9/i/6-mfkt-6-impex-original-imahbbgwhqcwyamk.jpeg?q=70&crop=false"
  },
  {
    "Title": "CG Homes 210 TC Microfiber King Printed Fitted (Elastic) Bedsheet (Pack of 1, Sky Blue)",
    "SKU": "itm482315e0a29d2",
    "Description": "What sets CG Homes India apart is our exquisite selection of unique colors, meticulously curated to complement any interior decor. Crafted from premium quality microfiber, our bedsheets are exceptionally breathable, ensuring optimum comfort all year round. The soft and plush texture of our bedsheets provides a gentle embrace, making it a joy to retreat into after a long day. One of the standout features of our bedsheet set is the variety of patterns on the bedsheets and pillow covers. Each set showcases different patterns, ensuring a unique and personalized touch to your bedding. Moreover, we take pride in offering a wide array of colors that are not commonly found. Crafted using breathable and comfortable microfiber fabric, our bedsheet set promises a cozy and soft feel. The fabric is not only gentle to the touch but also easy to care for. It remains fade-resistant even after multiple washes, ensuring that the stunning colors and patterns remain as vibrant as ever. Our bedsheet set comes in both fitted and flat sheet options, catering to individual preferences. The curated collection of unique designs, crafted by our talented designers, adds a touch of sophistication to your bedroom decor. Experience the luxury of CG Homes India's coordinated bedsheet set, where comfort meets style.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/bedsheet/p/g/s/printed-1-fitted-kb2107-fitted-elastic-cg-homes-original-imahakzkuqh5bwzm.jpeg?q=70&crop=false"
  },
  {
    "Title": "Decorum 204 TC Microfiber Double Floral Flat Bedsheet (Pack of 1, Blue)",
    "SKU": "itm351da254273c7",
    "Description": "Pure Microfiber Double bed-sheets that give a smooth touch and comfortable sleep all round the year. Vibrant colors of these bed-sheets will compliment all the colors in your room. combination of colors and style, this bedsheet is not to be missed out. Made from 100% Microfiber, and designed to give you a soft & comfortable feel, you can buy this trendy bedsheet with confidence. Add charm to your room with this uniquely styled & printed double bedsheet. Bedcolors is a one-stop-shop where you get high-quality bedsheets for your sweet and elegant home. Crafted from supreme quality Microfiber material, this Bedcolors Bedsheet is soft to touch and easy to wash.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/bedsheet/w/5/l/3d-blue-svera-double-bedsheet-1-blue-fool-1-flat-shyamvilla-original-imah2jtsngjgzv6j.jpeg?q=70&crop=false"
  },
  {
    "Title": "LIMETRO STEEL Set of 5 Copper Bottom Tope Multi Purpose (5 Pieces, 1 Ltr, 1.5 Ltr, 2 Ltr, 2.5 Ltr, 3 Ltr) Cookware Set (Stainless Steel, 5 - Piece)",
    "SKU": "itm6c105d3f14ede",
    "Description": "Package Contents 5 Piece Stainless Steel Copper Bottom Tope of Capacity 1000 ML, 1500 ML, 2000 ML, 2500 and 3000 ML , Details About Tope :- Dimensions of 1st Tope :- Diameter :- 7\" Inches i.e 17 CM , Height :- 3.5\" Inches i.e 9 CM Weight :- 271 Grams and Capacity :- 1000 ML Dimensions of 2nd Tope :- Diameter :- 7.75\" Inches i.e 19 CM , Height :- 4\" Inches i.e 10 CM Weight :- 311 Grams and Capacity :- 1500 ML Dimensions of 3rd Tope :- Diameter :- 8\" Inches i.e 20 CM , Height :- 4.8\" Inches i.e.12 CM Weight :- 395 Grams and Capacity :- 2000 ML Dimensions of 4th Tope :- Diameter :- 8.75\" Inches i.e 22 CM , Height :- 4.5\" Inches i.e 11.5 CM Weight :- 430 Grams and Capacity :- 2500 ML , Dimensions of 5th Tope :-Diameter :- 9 Inches i.e 23 CM , Height :- 5\" Inches i.e.13 CM Weight :- 525 Grams and Capacity :- 3000 MLRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/cookware-set/v/u/s/5-stainless-steel-set-of-5-copper-bottom-tope-set-limetro-steel-original-imah46hmggv2fz9u.jpeg?q=70&crop=false"
  },
  {
    "Title": "MZ M412SP (PORTABLE) Dynamic Thunder Sound With High Bass 5 W Bluetooth Speaker (Multicolor, Stereo Channel)",
    "SKU": "itm08029347893ca",
    "Description": "MZM412SP (PORTABLE BLUETOOTH SPEAKER) Dynamic Thunder Sound with High Bass 5 W Bluetooth Speaker. Its splash-proof features let you to enjoy your music anywhere indoor/outdoor. You can match it to your style quotient ,eye-catching contrast wherever it goes and easily compliments anyone’s style Portable Wireless Speaker Echo and noise cancelling features for calls Easy to operate; with volume and play/pause buttons for convenience Advanced wireless audio decoder chip, support all wireless devices connected., support Fm radio, you can search area stations directly Soft, clear and dynamic sound all levels clear, Support line in audio input, provide you with computer speakers can be connected to mobile phone tablet computer and TV wireless pairing playing music IBright colours help you pick one that fits your style and a built-in rechargeable battery keeps music pumping wherever and whenever you take it. Wireless Bluetooth Streaming Wirelessly stream high-quality stereo sound from your Smartphone or tablet. TF CARD TF Card Music Player: Built-in TF card read-only decoding can play TF card stored in MP3 / WMA format music directly Easy Connect Bluetooth is a short-range wireless communication technology that is both robust and energy efficient. The technology allows easy wireless connection to Bluetooth devices, such as smart phones, tablets or even laptops. Easy to Operate Bluetooth speakers made for electronic dance music (EDM). Compact, portable design for easy carrying. Built-in microphone, High-quality sound, Switch between audio and phone and take hands-free calls over Bluetooth.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/speaker/mobile-tablet-speaker/x/t/9/m412sp-portable-dynamic-thunder-sound-with-high-bass-mz-original-imah77cxzzv4tbz8.jpeg?q=70&crop=false"
  },
  {
    "Title": "SAMSUNG Galaxy F05 (Twilight Blue, 64 GB) (4 GB RAM)",
    "SKU": "itm84a914081ab93",
    "Description": "The latest Samsung Galaxy F05 PLS LCD display provides immersive viewing experience with 20:9 Aspect Ratio, Full HD+ Resolution with 720 x 1600 Pixels and 60Hz Refresh Rate. 5000mAh battery gives you power to use your smartphone without worrying about frequent charging. And, you get up to 2 generations of Android Upgrades with 4 years of security updates that provides you the best OS experience available for the next 2 years with Samsung One UI. Powered by MediaTek Helio G85 processor you can easily multi-task and play games with ease. Brilliant 50MP Camera with 8MP Selfie Camera, lets you capture memories beautifully which you can share with your friends & family.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/mobile/e/r/f/-original-imah56hkgehywn5b.jpeg?q=70&crop=false"
  },
  {
    "Title": "Roadster Medium 23 L Laptop Backpack Medium Daypack (Grey, Green)",
    "SKU": "itm4831b7c8adb11",
    "Description": "Product Spacious DesignBoasting a capacity of 23 L, the Roadster Laptop Backpack features multiple pockets that can help you carry all your essentials. Additionally, the compartments also help to keep your belongings organised. High-quality MaterialCrafted from polyester material, this laptop backpack is lightweight and easy to carry. Moreover, the fabric is waterproof, thus keeping your device safe from water damage. Sturdy BuiltCarefully stitched to endure heavy usage, this laptop backpack can last you a long time. Also, the smooth zippers ensure that you can easily access your belongings whenever required. Padded Straps Thanks to its padded straps, this bag doesn’t hurt your shoulders and lets you be comfortable. Style it RightIdeal for your outdoor adventures, this backpack will be your favourite travel companion. You can club it with a solid tee, track pants, and wayfarer sunglasses. View all features",
    "Image URL": "https://rukminim2.flixcart.com/image/832/832/xif0q/backpack/p/r/e/6-medium-daypack-12-rdstr-05-backpack-roadster-23-18-original-imahbj3eyrdvgszh.jpeg?q=70&crop=false"
  },
  {
    "Title": "VeBNoR Men Solid Polo Neck Polyester Grey T-Shirt",
    "SKU": "itm63a15cc6e20ab",
    "Description": "Product Classic Mandarin NeckShaped with a stylish mandarin neck, this men's T-shirt offers a modern yet versatile look suitable for different occasions. The simple neckline provides a comfortable fit around the neck without feeling restrictive, which allows for effortless wear throughout the day. Comfortable Sleeve FitHighlighting short sleeves, this T-shirt is designed for both comfort and style. The sleeves offer breathability, which makes it an ideal choice for different weather conditions. The short-sleeved design allows for easy movement while maintaining a polished and put-together look. Minimal Yet StylishFinished with a solid pattern, this T-shirt blends simplicity with sophistication. The regular fit strikes a balance between relaxed and structured, which ensures comfort without compromising on style. Thoughtfully designed, it complements a variety of looks, which makes it a dependable choice for daily wear. Hassle-free MaintenanceThanks to its low-maintenance fabric, this T-shirt is simple to care for and does not require additional effort to keep it looking fresh. To maintain its colour and shape, turning it inside out before washing it in cold water is recommended. You can wash similar colours together to help prevent colour bleeding while ironing at a low to medium heat ensures the fabric remains smooth. Flexible and LightweightDelivering with a polyester fabric, this T-shirt conforms comfortably to your body while ensuring freedom of movement. The fabric’s flexibility makes it a suitable choice for those with an active lifestyle, which allows for unrestricted comfort throughout the day. View all features",
    "Image URL": "https://rukminim2.flixcart.com/image/832/832/xif0q/t-shirt/q/a/g/l-ts103-vebnor-original-imahbg4yzue4cc7v.jpeg?q=70&crop=false"
  },
  {
    "Title": "Fire-Boltt Hunter 51.1mm (2.01) HD Display Buetooth Calling with Single Chipset, Metal Body Smartwatch (Green Strap, Free Size)",
    "SKU": "itm038b7c1d79542",
    "Description": "-presents Hunter smartwatch with the largest display of 2.01inch. The watch covers your wrist and sets perfectlyRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/smartwatch/b/g/l/-original-imah95n5hwxcgghe.jpeg?q=70&crop=false"
  },
  {
    "Title": "Fastrack Optimus2 Pro-1.43'' AMOLED|Advanced Blazing Fast UI|AOD|Metal Case|Working Crown Smartwatch (Gun Black Strap, Free Size)",
    "SKU": "itm7aa50ddb7212a",
    "Description": "1.43\" AMOLED Display with Bright Pixel Resolution,SingleSync BT Calling with Advanced Chipset, Calculator, AI Voice Assistant, 100+ Sports Modes, One Click Health Measurement, Auto Stress Monitor, 24x7 Heart Rate Monitor, SpO2 and Sleep Monitor with REM Sleep, Breathe Exercise, Alarm, Stopwatch and Timer, Notifications, Weather Display, Camera and Music ControRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/smartwatch/3/8/t/-original-imah5hztanu9zpxg.jpeg?q=70&crop=false"
  },
  {
    "Title": "MILTON Pro Cook Kitchen Jewel Plus Granito, Peach Induction Bottom Non-Stick Coated Cookware Set (Aluminium, 3 - Piece)",
    "SKU": "itmd489376e3a146",
    "Description": "Introducing Milton Pro Cook Kitchen Jewel Set. Every Kitchen has its own unique food story which needs perfect weaving. Presenting My Kitchen Sets that are thoughtfully designed and curated keeping in mind your daily cookware requirement. The collection comes in set of 3 which consists a Tawa, a Fry Pan and a Kadhai with Lid. All 3 cookware have meticulously crafted soft-touch and sturdy handle for perfect grip. This kitchen cookware set comes with PFOA free non-stick coating for hassle free cooking. This set can be used with induction cook tops It is easy to clean and easy to maintain, even with everyday usage. This is PFOA Free non-toxic and lightweight, you can enjoy food absolutely worry-free. The non-stick coating requires less oil and designed to survive your daily use, perfect for high heat with minimum oil or buttercream for those into a healthy diet. This kitchen set has attractive exterior color which can suit the kitchen decor. The kadhai has glass lid with steam vent for retaining moisture for cooking. Ergonomically designed detachable handles to save space in your kitchen. This kitchen set is Friendly with gas stove as well as induction cooking, it is a flexible fit for your kitchen. This Product Is Under 1 Year Warranty From The Date Of Retail Purchase Against Any Manufacturing Defects In Material And Workmanship. The Warranty Does Not Cover Damages Resulting From Accidents, Mishandling Or Tampering With The Mechanism. Warranty Valid Against Producing Original Bill Endorsed By Seller. For any queries kindly reach customer care number as mentioned on the product packaging along with the proof of purchase.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/shopsy-cookware-set/n/b/q/3-cckwckn313peme0001-milton-original-imagrk4hgfzhp885.jpeg?q=70&crop=false"
  },
  {
    "Title": "SAREGAMA Bengali with 3000 pre-loaded songs 20 W Bluetooth Party Speaker (Graphite Grey, Stereo Channel)",
    "SKU": "itmc9e2588bf02b4",
    "Description": "Carvaan Lite – Light on Size & Light on Price. 3000 Evergreen Superhit Bengali Songs with built-in speakers, FM, AM, Bluetooth & rechargeable battery. Carvaan Lite Bengali comes pre-loaded with 3000 Evergreen Superhit songRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/speaker/home-audio-speaker/d/z/b/scl190-scl190-beng-saregama-original-imagvjeumhxfugk6.jpeg?q=70&crop=false"
  },
  {
    "Title": "ASUS TUF Gaming A15 AMD Ryzen 5 Hexa Core 7535HS - (8 GB/512 GB SSD/Windows 11 Pro/4 GB Graphics/NVIDIA GeForce RTX 2050) FA506NF-HN578W Gaming Laptop (15.6 Inch, Graphite Black, 2.30 Kg)",
    "SKU": "itm10514ecd2a794",
    "Description": "If you have any gaming needs, this TUF Gaming A15 laptop is the perfect choice for you. Powered by an AMD Ryzen 7000-Series GPU, this laptop is capable of handling all your processing needs. It also features an IPS-level display panel with a refresh rate of 144 Hz. You also get an Xbox Game Pass subscription along with this laptop, giving you access to a vast library of games. Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/computer/r/x/3/-original-imah3hxgdqcdpvmr.jpeg?q=70&crop=false"
  },
  {
    "Title": "JBL Go Essential with Rich Bass, 5 Hrs Playtime, IPX7 Waterproof, Ultra Portable 3.1 W Bluetooth Speaker (Black, Mono Channel)",
    "SKU": "itm1c2d1118508ca",
    "Description": "You can listen to your favourite songs in high quality with the JBL Go Essential Portable Bluetooth Speaker. With up to 5 hours of playtime on a single charge, this speaker delivers an uninterrupted audio experience. As this speaker boasts an IPX7-rated waterproof design, so you can carry it wherever you want, whether in a pool or a park. In addition, thanks to its Bluetooth 4.2 connectivity, this speaker lets you conveniently stream a wide range of songs from your tablet, phone, or any other Bluetooth-enabled device. Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/l27wtjk0/speaker/i/4/e/-original-imagdhhg2f7zjbt7.jpeg?q=70&crop=false"
  },
  {
    "Title": "KAANY FAB 180 TC Cotton Double Jaipuri Prints Flat Bedsheet (Pack of 2, Multicolor)",
    "SKU": "itm758ba7063dd7d",
    "Description": "kaany fab 100% soft cotton Double Bedcovers and featuring beautiful Indian inspired designs, this Bed covers is perfect for anyone looking to add a splash of culture to their bedroom. We Invite Products Into Your Home For their form and function and experience their style ,craftsmanship,and most sensible manufacturing methods. Soft luxury bedding for an affordable price, graceful and modern look for any bedsheet, fade -resistant, These sheets are made of high stenth micro fiber yarns that stay comfortable and wrinkle free for year to come. These sheets retain their vibrant colour , Providing the needed charm to complete Any Bedroom. Care Instructions:-Machine wash in cold water, tumble dry on low heat and do not bleach, Dry Clean or Iron.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/bedsheet/e/z/v/rajasthani-print-2-jaipuri-print21-flat-kaany-fab-original-imahfzk5m8zycytc.jpeg?q=70&crop=false"
  },
  {
    "Title": "Kreme 5pcs Set Combo Non-Stick Coated Cookware Set (Aluminium, 7 - Piece)",
    "SKU": "itm7578154da042c",
    "Description": "Kreme NonStick 5pcs Set Combo (Non Induction) Non-Stick Coated Cookware SetRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/cookware-set/y/b/z/7-kan-cs-006-kreme-original-imagszadt9k7mn3g.jpeg?q=70&crop=false"
  },
  {
    "Title": "Stybits A814 Wireless Nack band with Type-C Fast Charge & Bass Boost+ Bluetooth (Black, True Wireless)",
    "SKU": "itmf62b87068fdf7",
    "Description": "The ARU JOY JNB-1132 is a wireless Bluetooth headphone with a magnetic neckband design, providing convenience and portability. Here are the key features and specifications: Wireless Connectivity: Bluetooth Version: 5.1 Range: 10 meters Design: Magnetic Neckband: The headphones come with a magnetic neckband, ensuring easy and secure storage when not in use. Audio Output: Output Power: 3mW x 2 Impedance: 160 ohms Sensitivity: 128dB at 1kHz Battery Life: Talk Time: Up to 30 hours Music Playback Time: Up to 25 hours Standby Time: Up to 250 hours Battery Capacity: 200mAh Charging: Full Charge Time: 1 hour Additional Features: The headphones provide a reliable wireless connection with a Bluetooth version 5.1, ensuring compatibility with a wide range of devices. The magnetic neckband design adds convenience by keeping the earbuds securely in place when not in use. The headphones offer a long battery life, providing up to 30 hours of talk time and 25 hours of music playback on a single charge. The quick charging feature allows for a full charge in just 1 hour. With a range of 10 meters, users can enjoy wireless freedom without being tethered to their devices. Please note that specific details may vary, and it's always a good idea to refer to the product manual or official specifications for the most accurate and up-to-date information.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/headphone/h/6/x/a814-wireless-nack-band-with-type-c-fast-charge-bass-boost-bydye-original-imahfbbf4j5qhhzb.jpeg?q=70&crop=false"
  },
  {
    "Title": "SAMSUNG Galaxy Book4 Intel Core i5 13th Gen 1335U - (8 GB/512 GB SSD/Windows 11 Home) NP750XGJ-KG1IN / NP750XGJ-LG1IN Thin and Light Laptop (15.6 Inch, Gray, 1.55 Kg, With MS Office)",
    "SKU": "itm820dc496ef160",
    "Description": "With a 13th-generation Intel Core CPU for fluid productivity, up to 1 TB of SSD storage, and Intel Xe graphics for entertainment, the Samsung Galaxy Book4 laptop is a great device. Its stylish aluminium body weighs only 1.55 kg, and its 39.62 cm (15.6) Full HD display is part of it. There are ports for RJ45, HDMI, microSD, USB-A, and USB-C connectivity. Ensured productivity on the move, the little charger is compatible with other Samsung Galaxy smartphones. Make use of Dolby Atmos speakers for immersive audio. The seamless device integration provided by the Galaxy ecosystem boosts productivity and creativity. Utilise the excellent camera on your Galaxy phone for video chats, and use File Explorer to access phone files. Old photographs are given new life by AI-powered Photo Remaster, and cross-device video editing is possible with Samsung Studio. Quick Share and Phone Link make it simple to share files and view them on your phone from your PC, while Multi Control increases productivity by allowing you to navigate between devices.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/computer/3/g/m/-original-imah3xrqttkdbss4.jpeg?q=70&crop=false"
  },
  {
    "Title": "VGR V-937 Professional Hair Trimmer with LED Display Trimmer 500 min Runtime 4 Length Settings (Black)",
    "SKU": "itm77c0990b7d0d1",
    "Description": "The VGR V-937 hair trimmer blade is made up of high-quality stainless steel. To provides you a trim that is more accurateRead More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/trimmer/8/k/l/0-5-4-mm-v-937-professional-hair-trimmer-with-led-display-original-imahb9zjgyb8k6hj.jpeg?q=70&crop=false"
  },
  {
    "Title": "VGR V-290 Professional Hair Clipper with LED Display Trimmer 120 min Runtime 4 Length Settings (Gold)",
    "SKU": "itm9e53366e37cb3",
    "Description": "This VGR V-290 hair trimmer blade is made up of premium quality stainless steel. To protect your skin from harms and infection. This hair trimmer body it made up of premium metal body. This VGR hair trimmer blade is T-type and specially designed for beard styling and sharp cut or trimming experience. For more accurate and efficient cut or trim. VGR provides you 3 hair cutting guide combs with the range of 1mm, 2mm to 3mm. With provided hair cutting guide combs you can easily adjust the length of the trim according to your desired length and choice. Without guide combs this hair trimmer provides 0.5mm cut or trim.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/trimmer/q/h/s/0-5-3-mm-v-290-professional-hair-clipper-with-led-display-original-imahb5sbtnm526cq.jpeg?q=70&crop=false"
  },
  {
    "Title": "Apple iPhone 16 Plus (Pink, 128 GB)",
    "SKU": "itm9761d2a9d8939",
    "Description": "iPhone 16 Plus. Built for Apple Intelligence. Featuring Camera Control. 48 MP Fusion camera. Five vibrant colours. And A18 chip.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/mobile/o/8/z/-original-imah4jykj39bgzsh.jpeg?q=70&crop=false"
  },
  {
    "Title": "boAt Airdopes 131 with upto 60 hours and ASAP Charge Bluetooth (Midnight Blue, True Wireless)",
    "SKU": "itmf77ad6e8eecf1",
    "Description": "Are you looking for a wireless earbud-type headset that delivers an impressive playback time? If your answer is yes, bring home the boAt Airdopes 131 that comes with a carrying case. This carrying case also acts as a 650 mAh portable charger that extends the playback time of these earbuds by up to 15 hours, i.e. 4 times its normal charging capacity. The normal battery capacity of each of these earbuds is 40 mAh and this delivers up to 3 hours of playback time. These earbuds feature Bluetooth v5.0 technology that delivers a stable connection that lets your rock on without connectivity issues. The stereo calling feature of these earbuds allows you to enjoy calls via its built-in microphone and 13-mm drivers. These earbuds are powered up by the IWP Technology featured in them the moment you open the case. The presence of a Type-C charging port ensures you can easily charge it with any charger that has a compatible cable.Read More",
    "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/headphone/5/g/7/-original-imagqhswqrx7sn3w.jpeg?q=70&crop=false"
  },
  {
  "Title": "Classic Essentials Pink Colour Induction friendly Handi/patila/bhagona cook & serve Cookware Set (Stainless Steel, 10 - Piece)",
  "SKU": "itme20891cdb82c9",
  "Description": "Serving & Mixing Bowl – Set of 5 SET of SERVING & MIXING BOWLS We present you serving bowls In all the sizes you need for storing, keeping, mixing and more, capacity ranges as 1500 ml, 1100 ml, 750 ml, 550ml, 300 ml. Fashionable and high quality with 201 grade steel, Sky Blue color Matt finish that far out classes your old mixing and mixer bowls. Improvements include bent edges for easier handling and fewer spills. Flat bottoms for best stability when using them.PREMIUM QUALITY:Bowls made with high grade 201 stainless steel. This is the standard for fine restaurants, bakeries, and commercial kitchens. You'll love the easy-grip, rounded lip for faster, easier handling. The wide rim lets you easily pour liquids without spills or drips.BRIGHT Color Brighten your kitchen with the color of these fun, elegant, and lightweight stainless steel mixing bowls that can double as serving bowls. They hand wash easily and won’t stain or rust, ensuring they’ll last you a long time.STACKABLE FOR CONVENIENT STORING.Each of the 5 bowls are sized just right to perfectly fit into the next one. Stack them all in just seconds for convenient, compact storing. These bowls are great for mixing, serving vegetables, keeping foods in the refrigerator, fruit bowls, popcorn bowls, serving bowls, salad bowls, ingredient bowls, cereal bowls, cookie bowls, ice cream bowls and more!DISHWASHER SAFE, GREAT FOR FRIDGE & FREEZER.Simply put these bowls in the dishwasher to get them crystal clean. Save money by storing foods in the refrigerator and freezer.HURRY AND BUY NOW While we have this very popular and economical set in stock. This makes a wonderful gift for the cook in your family. Best for birthdays, anniversaries, friends, family, and co-worker",
  "Image URL": "https://rukminim2.flixcart.com/image/416/416/xif0q/cookware-set/d/p/n/10-cook-serve-handi-5-serving-spoon-5-classic-essentials-original-imahybyeutdgjuae.jpeg?q=70&crop=false"
}
]